package homework01;

public class Main {
    public static void main(String[] args) {
        System.out.println(Calculator.calculateDiscount(150.0, 13));
        // TODO: Задание 2. (необязательное)
        // Мы хотим улучшить функциональность нашего интернет-магазина.
        // Ваша задача - добавить два новых метода в класс Shop:
        // Метод sortProductsByPrice(), который сортирует список продуктов по стоимости.
        // Метод getMostExpensiveProduct(), который возвращает самый дорогой продукт. Напишите тесты,
        // чтобы проверить, что магазин хранит верный список продуктов
        // (правильное количество продуктов, верное содержимое корзины).
        // Напишите тесты для проверки корректности работы метода getMostExpensiveProduct.
        // Напишите тесты для проверки корректности работы метода sortProductsByPrice (проверьте правильность сортировки).
        // Используйте класс Product для создания экземпляров продуктов
        // и класс Shop для написания методов сортировки и тестов
    }
}
